'use strict'
// Если переменная test равна true, то выведите 'Верно', иначе выведите 'Неверно'. 
// Проверьте работу скрипта при test, равном true, false. Напишите два варианта скрипта - с короткой записью и с длинной.

// let test = true ? test != false;


// let test = true; 
// if (test) {      
// alert('Verno');
// } else {
// alert('Neverno');
// };

// Если переменная test не равна true, то выведите 'Верно', 
// иначе выведите 'Неверно'. Проверьте работу скрипта при test, равном true, false. 
// Напишите два варианта скрипта - с короткой записью и с длинной.

// let test = 0;
// if (test != true) {
// alert('Verno');
// } else {
// alert('Neverno');
// };

